       IDENTIFICATION DIVISION.
       PROGRAM-ID. AREA.
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES. 
          DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ALTURA      PIC 9(9) VALUE ZEROS.
       01 BASE        PIC 9(9) VALUE ZEROS.
       01 ÁREA        PIC 9(9) VALUE ZEROS.
       01 RESULTADO   PIC ZZZ.ZZZ .
       PROCEDURE DIVISION.
       DISPLAY "INSIRE O VALOR DA ALTURA: ". BELL. ACCEPT ALTURA.

       DISPLAY "DIGITE O VALOR DA BASE: ".   BELL. ACCEPT BASE.

       MULTIPLY BASE BY ALTURA GIVING ÁREA.
       DIVIDE 2 INTO                  ÁREA.
       MOVE ÁREA TO              RESULTADO.
       
       DISPLAY "O RESULTADO É: " RESULTADO "" "METROS".
       
       STOP RUN.
       