       IDENTIFICATION DIVISION.
       PROGRAM-ID. INVENTORY.
           AUTHOR. LUIZ.
           DATE-WRITTEN. 10/23/2024.

       ENVIRONMENT DIVISION.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
           SELECT REPORT-FILE ASSIGN TO "PRODUCTS.txt"
              ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.

       FILE SECTION.
       FD REPORT-FILE.
        01 REPORT-RULE.
            05 PRODUCT-NAME-FIELD PIC A(255). 
            05 PROD-QUANTITY-FIELD PIC 9(5).

       WORKING-STORAGE SECTION.

       01 PRODUCTS.
          05 PRODUCT-NAME       PIC A(30) OCCURS 100 TIMES.
          05 CURRENT-QUANTITY   PIC 9(5)  OCCURS 100 TIMES.
          05 MINIMUM-QUANTITY   PIC 9(5)  OCCURS 100 TIMES VALUE 5.

       01 TOTAL-TO-REGISTER     PIC 9(3) VALUE 0.
       01 I                     PIC 9(3) VALUE 1.
       01 PROGRAM-END           PIC 9(1) VALUE '0'.

       01 TEMP-NAME             PIC A(30).
       01 TEMP-QUANTITY         PIC 9(5).

       PROCEDURE DIVISION.

       DISPLAY "TYPE 0 TO EXIT OR 1 TO CONTINUE".
       ACCEPT PROGRAM-END.

       IF PROGRAM-END = '0'
           DISPLAY "PROGRAM TERMINATED BY USER."
           STOP RUN
       ELSE
           DISPLAY "HOW MANY PRODUCTS DO YOU WANT TO REGISTER?"
           ACCEPT TOTAL-TO-REGISTER

           PERFORM VARYING I FROM 1 BY 1 UNTIL I > TOTAL-TO-REGISTER
               DISPLAY "ENTER PRODUCT NAME: "
               ACCEPT TEMP-NAME
               MOVE TEMP-NAME TO PRODUCT-NAME(I)

               DISPLAY "ENTER CURRENT PRODUCT QUANTITY: "
               ACCEPT TEMP-QUANTITY
               MOVE TEMP-QUANTITY TO CURRENT-QUANTITY(I)

               IF CURRENT-QUANTITY(I) < MINIMUM-QUANTITY(I)
                   DISPLAY "PRODUCT " PRODUCT-NAME(I) " IS BELOW"
               ELSE
                   DISPLAY "ALL GOOD WITH " PRODUCT-NAME(I)
               END-IF
           END-PERFORM
       END-IF.

       DISPLAY "THE REGISTERED PRODUCTS ARE:"
         PERFORM VARYING I FROM 1 BY 1 UNTIL I > TOTAL-TO-REGISTER
              DISPLAY "PRODUCT: " PRODUCT-NAME(I)
              DISPLAY "QUANTITY: " CURRENT-QUANTITY(I)
         END-PERFORM.

       OPEN OUTPUT REPORT-FILE.

           PERFORM VARYING I FROM 1 BY 1 UNTIL I > TOTAL-TO-REGISTER
           MOVE PRODUCT-NAME(I) TO PRODUCT-NAME-FIELD
           WRITE REPORT-RULE

       END-PERFORM


       CLOSE REPORT-FILE.


       STOP RUN.
