       IDENTIFICATION DIVISION.
       PROGRAM-ID. MIDIUM.
       ENVIRONMENT DIVISION.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
        SELECT ARQUIVO-RELATORIO ASSIGN TO 'REPORT.txt'
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.

       FILE SECTION.

       FD ARQUIVO-RELATORIO.
       01 REG-RELATORIO.
           05 LINHA-REPORTE PIC X(280).

       WORKING-STORAGE SECTION.

       01 FUNCIONARIO. 
           05 CODIGO PIC 9(2) VALUE ZEROS.
           05 NOME   PIC A(128)   VALUE SPACES.
           05 ENDERECO.
               10 RUA PIC A(20) VALUE SPACES.
               10 NUMERO PIC 9(3) VALUE ZEROS.
               10 COMPLEMENTO PIC A(255) VALUE SPACES.
           05 NASCIMENTO PIC 9(6) VALUE ZEROS.
           05 CPF PIC 9(11) VALUE ZEROS.
           05 ESTADO PIC A(2) VALUE SPACES.
           05 CIDADE PIC A(50) VALUE SPACES.

       01 HORAS.
           05 HORA-EXTRAS   PIC 9(4) VALUE ZEROS.
           05 HORA-EXTRA    PIC 9(4) VALUE 20.
           05 HORA-TOTAL    PIC 9(4) VALUE ZEROS.

       01 SALARIOS.
            05 SALARIO-BASE  PIC 9(7) VALUE ZEROS.
            05 SALARIO-TOTAL PIC 9(7) VALUE ZEROS.


       PROCEDURE DIVISION.

       DISPLAY "BEM VINDO AO RELATÓRIO DE FUNCIONÁRIO!".       
       DISPLAY "PRIMEIRO, VAMOS PEGAR OS DADOS!"       
       DISPLAY "DIGITE O CÓDIGO DO FUNCIONÁRIO (SOMENTE 2 DÍGITOS)!"
       ACCEPT CODIGO.       
       DISPLAY "DIGITE O NOME DO FUNCIONÁRIO".
       ACCEPT NOME.
       DISPLAY "AGORA VOCÊ IRÁ DIGITAR O ENDEREÇO".
       DISPLAY "DIGITE OS SEGUITES DADOS (EM SEQUÊNCIA)".
       DISPLAY "RUA, NUMERO E COMPLEMENTO".
       ACCEPT RUA.
       ACCEPT NUMERO.
       ACCEPT COMPLEMENTO.
       DISPLAY "AGORA DIGITE A DATA DE NASCIMENTO (SOMENTE NÚMEROS)".
       ACCEPT NASCIMENTO.
       DISPLAY "AGORA DIGITE O CPF (SOMENTE NÚMEROS)".
       ACCEPT CPF.
       DISPLAY "DIGITE O ESTADO (UF)".
       ACCEPT ESTADO.
       DISPLAY "DIGITE A CIDADE".
       ACCEPT CIDADE.

       DISPLAY "AGORA VOCÊ IRÁ INFORMAR AS HORAS EXTRAS SEMANAIS"
       ACCEPT HORA-EXTRAS.
       DISPLAY "DIGITE O SALÁRIO".
       ACCEPT SALARIO-BASE.

       MULTIPLY HORA-EXTRAS BY HORA-EXTRA GIVING HORA-TOTAL.
       ADD HORA-TOTAL TO SALARIO-BASE GIVING SALARIO-TOTAL.

       OPEN OUTPUT ARQUIVO-RELATORIO.
         MOVE SPACES TO LINHA-REPORTE.
         STRING "CPF: " DELIMITED BY SIZE
       CPF DELIMITED BY SIZE
       INTO LINHA-REPORTE.
       WRITE REG-RELATORIO.

       MOVE SPACES TO LINHA-REPORTE.
       STRING "NOME: " DELIMITED BY SIZE
       NOME DELIMITED BY SIZE
       INTO LINHA-REPORTE.
       WRITE REG-RELATORIO.

       MOVE SPACES TO LINHA-REPORTE.
       STRING "CÓDIGO: " DELIMITED BY SIZE
       CODIGO DELIMITED BY SIZE
       INTO LINHA-REPORTE.
       WRITE REG-RELATORIO.

       MOVE SPACES TO LINHA-REPORTE.
       STRING "ENDEREÇO: " DELIMITED BY SIZE
       RUA DELIMITED BY SIZE
       ", " DELIMITED BY SIZE
       NUMERO DELIMITED BY SIZE
       ", " DELIMITED BY SIZE
       COMPLEMENTO DELIMITED BY SIZE
       INTO LINHA-REPORTE.
       WRITE REG-RELATORIO.

       MOVE SPACES TO LINHA-REPORTE.
       STRING "NASCIMENTO: " DELIMITED BY SIZE
       NASCIMENTO DELIMITED BY SIZE
       INTO LINHA-REPORTE.
       WRITE REG-RELATORIO.

       MOVE SPACES TO LINHA-REPORTE.
       STRING "ESTADO: " DELIMITED BY SIZE
       ESTADO DELIMITED BY SIZE
       " - CIDADE: " DELIMITED BY SIZE
       CIDADE DELIMITED BY SIZE
       INTO LINHA-REPORTE.
       WRITE REG-RELATORIO.

       MOVE SPACES TO LINHA-REPORTE.
       STRING "HORAS EXTRAS: " DELIMITED BY SIZE
       HORA-EXTRAS DELIMITED BY SIZE
       INTO LINHA-REPORTE.
       WRITE REG-RELATORIO.

       MOVE SPACES TO LINHA-REPORTE.
       STRING "SALÁRIO TOTAL: " DELIMITED BY SIZE
       SALARIO-TOTAL DELIMITED BY SIZE
       INTO LINHA-REPORTE.
       WRITE REG-RELATORIO.
       CLOSE ARQUIVO-RELATORIO.
       DISPLAY "RELATÓRIO GERADO COM SUCESSO!".

       STOP RUN.
