       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABUADA.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
         01 NUMERO        PIC 9(9) VALUE ZEROS.
         01 I             PIC 9(2) VALUE ZEROS.
         01 NUMERO-Z      PIC Z(9).
         01 RESTO         PIC Z(2).
       
       PROCEDURE DIVISION.
      
       DISPLAY "INSIRA UM NÚMERO PARA CALCULARMOS A TABUADA: ".
       ACCEPT NUMERO.

       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
           MULTIPLY NUMERO BY I GIVING RESTO
           MOVE NUMERO TO NUMERO-Z
           DISPLAY NUMERO-Z " X " I " = " RESTO
       END-PERFORM
       
       STOP RUN.
